# LECTURE # 4 , OCT 13, 2019

In [5]:
import pandas as pd

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [6]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [7]:
pd.DataFrame(data, columns=['pop','year','state'])

   pop  year   state
0  1.5  2000    Ohio
1  1.7  2001    Ohio
2  3.6  2002    Ohio
3  2.4  2001  Nevada
4  2.9  2002  Nevada
5  3.2  2003  Nevada

In [12]:
frame=pd.DataFrame(data, columns=['pop','year','state','extra'], index = ["one","two","three","four","five","six"])

In [13]:
frame

       pop  year   state extra
one    1.5  2000    Ohio   NaN
two    1.7  2001    Ohio   NaN
three  3.6  2002    Ohio   NaN
four   2.4  2001  Nevada   NaN
five   2.9  2002  Nevada   NaN
six    3.2  2003  Nevada   NaN

In [14]:
frame.columns

Index(['pop', 'year', 'state', 'extra'], dtype='object')

In [15]:
frame.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [16]:
frame.loc["one"]

pop       1.5
year     2000
state    Ohio
extra     NaN
Name: one, dtype: object

In [17]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [18]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [19]:
frame.extra=val

In [20]:
frame

       pop  year   state  extra
one    1.5  2000    Ohio    NaN
two    1.7  2001    Ohio   -1.2
three  3.6  2002    Ohio    NaN
four   2.4  2001  Nevada   -1.5
five   2.9  2002  Nevada   -1.7
six    3.2  2003  Nevada    NaN

In [23]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)

In [24]:
frame3 # dictionaries ki keys index ban gayen

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6